print("안녕하세요?")
print(10,"+",20,"=",10+20)

print("100") #문자의 형태로 출력 (일, 영, 영)

print("%d" %100) #숫자의 형태로 출력 (백)

print("100+100")            #100+100이라는 문장이 출력
print("%d" %(100+100))

#print("%d" %(100, 200))     #200이 인식되지 않음
print("%d %d" %(100, 200))

print("%d + %d = %d" %(10, 20, 10+20))

print("%.1f + %.1f = %.1f" %(0.5, 1.5, 0.5+1.5))

print(0.5,"+",1.5,"=",0.5+1.5)

print("%d" %123)
print("%5d" %123)
print("%05d" %123)
print("%05d+%05d=%05d" %(123,122,123+122))
print("%7.1f"%123.45)

print("%f" %123.45)
print("%7.3f" %123.45)
print(123.45,"+",122.12,"=",123.45+122.12)

print("%s" %"안녕하세요")
print("오늘은"," ","월요일 입니다")
print("%s %s"%("오늘은","월요일 입니다"))

print("%7.1f %7.2f" %(123.35, 123.35))

print("{0:d} {1:5d} {2:05d}" .format(121,122,123))
print("{2:05d} {1:5d} {0:d}" .format(121,122,123))
